Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Publish to Team Catalog…
fr: Publier dans le catalogue de l'équipe...
ko: 팀 카탈로그에 게시…
tr: Takım Kataloğuna Yayınla…
vi: Xuất bản lên danh mục nhóm…
zh_hans: 发布到团队目录…
zh_hant: 發佈到團隊目錄…

source: Schema it ran against
fr: Le schéma contre lequel il a été exécuté
ko: 실행 대상 스키마
tr: Karşı çalıştığı şema
vi: Schema mà nó chạy trên đó
zh_hans: 它所针对的 Schema
zh_hant: 它所針對的綱要

source: Search schemas...
fr: Rechercher les schémas...
ko: 스키마 검색...
vi: Tìm schema...
zh_hans: 搜索 Schema...
zh_hant: 搜尋綱要…

source: %@ no longer stores its INCLUDE columns
fr: %@ ne stocke plus ses colonnes INCLUDE.

source: Rows per insertMany
fr: Rangs par insertion Nombreux
ko: insertMany당 행 수
vi: Số dòng mỗi insertMany
zh_hans: 每条 insertMany 的行数
zh_hant: 每筆 insertMany 的列數

source: Verify Identity
fr: Vérifier l'identité
ko: 신원 확인
tr: Kimliği Doğrula
vi: Xác minh danh tính
zh_hans: 验证身份
zh_hant: 驗證身分

source: Search
fr: Recherche
ko: 검색
tr: Ara
vi: Tìm kiếm
zh_hans: 搜索
zh_hant: 搜尋

source: Advanced
fr: Avancé
ko: 고급
tr: Gelişmiş
vi: Nâng cao
zh_hans: 高级
zh_hant: 進階

source: Hide Column
fr: Masquer la colonne
ko: 열 가리기
tr: Sütunu Gizle
vi: Ẩn cột
zh_hans: 隐藏列
zh_hant: 隱藏欄位

source: Custom Slash Commands
fr: Commandes Slash personnalisées
ko: 사용자 지정 슬래시 명령
tr: Özel Eğik Çizgi Komutları
vi: Lệnh slash tùy chỉnh
zh_hans: 自定义斜杠命令
zh_hant: 自訂斜線指令

source: UPPERCASE
fr: MAJUSCULE

source: Delete Index
fr: Supprimer l'index
ko: 인덱스 삭제
tr: İndeksi Sil
vi: Xóa chỉ mục
zh_hans: 删除索引
zh_hant: 刪除索引

# %d statements failed, so the run was rolled back and %@ is unchanged.
source: %1$d statements failed, so the run was rolled back and %2$@ is unchanged.
fr: Les déclarations %1$d ont échoué, donc la mise en œuvre a été annulée et %2$@ n'a pas changé.

source: Not loaded yet
fr: Pas encore chargé

source: Range Type
fr: Type de gamme

source: Open File…
fr: Ouvrir le fichier...
ko: 파일 열기…
tr: Dosya Aç…
vi: Mở tệp…
zh_hans: 打开文件…
zh_hant: 開啟檔案…

source: Available in all connections
fr: Disponible dans toutes les connexions
ko: 모든 연결에서 사용 가능
tr: Tüm bağlantılarda kullanılabilir
vi: Có trong mọi kết nối
zh_hans: 在所有连接中可用
zh_hant: 在所有連線中可用

source: Move Word Left
fr: Déplacez le mot à gauche
ko: 단어 단위로 왼쪽 이동
tr: Bir Kelime Sola Git
vi: Sang trái một từ
zh_hans: 向左移动一个单词
zh_hant: 向左移動一個單字

source: Executing
fr: Exécutant
ko: 실행 중
tr: Çalıştırılıyor
vi: Đang thực thi
zh_hans: 执行中
zh_hant: 執行中

source: TablePro only notifies when the result is not already on screen.
fr: TablePro ne vous informe que lorsque le résultat n'est pas déjà à l'écran.
ko: TablePro는 결과가 화면에 아직 보이지 않을 때만 알립니다.
tr: TablePro yalnızca sonuç ekranda değilken bildirir.
vi: TablePro chỉ thông báo khi kết quả chưa hiện trên màn hình.
zh_hans: 只有当结果尚未显示在屏幕上时，TablePro 才会通知。
zh_hant: 只有當結果尚未顯示在螢幕上時，TablePro 才會通知。

source: Review
fr: Revue

source: Must be exactly: I understand this is irreversible
fr: Doit être exact : Je comprends que c'est irréversible.
ko: 다음과 정확히 일치해야 합니다: I understand this is irreversible
tr: Tam olarak şöyle olmalı: I understand this is irreversible
vi: Phải nhập chính xác: I understand this is irreversible
zh_hans: 必须完全输入：I understand this is irreversible
zh_hant: 必須完全輸入：I understand this is irreversible

source: This connection's CA certificate is not readable on this device (%@). Certificate files do not sync between devices, so add the certificate here or lower the SSL mode to Required.
fr: Le certificat CA de cette connexion n'est pas lisible sur cet appareil (%@). Les fichiers de certificat ne se synchronisent pas entre les appareils, alors ajoutez le certificat ici ou réduisez le mode SSL à Obligatoire.
ko: 이 기기에서 이 연결의 CA 인증서를 읽을 수 없습니다(%@). 인증서 파일은 기기 간에 동기화되지 않으므로 이 기기에 인증서를 추가하거나 SSL 모드를 필수(Required)로 낮추십시오.
tr: Bu bağlantının CA sertifikası bu cihazda okunamıyor (%@). Sertifika dosyaları cihazlar arasında eşitlenmez, bu yüzden sertifikayı buraya ekleyin ya da SSL modunu Zorunlu'ya düşürün.
vi: Không đọc được chứng chỉ CA của kết nối này trên thiết bị này (%@). Tệp chứng chỉ không đồng bộ giữa các thiết bị, nên hãy thêm chứng chỉ tại đây hoặc hạ chế độ SSL xuống Required.
zh_hans: 此连接的 CA 证书在本设备上不可读（%@）。证书文件不会在设备之间同步，请在此处添加证书，或将 SSL 模式降为“必需”。
zh_hant: 此連線的 CA 憑證在本裝置上無法讀取（%@）。憑證檔案不會在裝置之間同步，請在此處加入憑證，或將 SSL 模式降為「必要」。

source: No Columns Defined
fr: Aucune colonne définie
ko: 정의된 열 없음
tr: Tanımlı Sütun Yok
vi: Chưa có cột nào
zh_hans: 尚未定义列
zh_hant: 尚未定義欄位

source: Language the routine is written in
fr: Langue dans laquelle la routine est écrite
ko: 루틴이 작성된 언어
tr: Rutinin yazıldığı dil
vi: Ngôn ngữ mà routine được viết bằng
zh_hans: 该例程所用的语言
zh_hant: 該常式所用的語言

source: Auto-uppercase keywords
fr: Mots-clés en majuscules automatiquement
ko: 키워드 자동 대문자 변환
tr: Anahtar kelimeleri otomatik büyük yaz
vi: Tự động viết hoa từ khóa
zh_hans: 自动大写关键字
zh_hant: 關鍵字自動轉大寫

source: Expected Behavior
fr: Comportement attendu
ko: 예상 동작
tr: Beklenen Davranış
vi: Hành vi mong đợi
zh_hans: 预期行为
zh_hant: 預期行為

source: Some Changes Are Incomplete
fr: Certaines modifications sont incomplètes.

source: Data Grid
fr: Grille de données
ko: 데이터 그리드
tr: Veri Tablosu
vi: Lưới dữ liệu
zh_hans: 数据网格
zh_hant: 資料格

source: Show connections
fr: Afficher les connexions
ko: 연결 보기
tr: Bağlantıları göster
vi: Hiện kết nối
zh_hans: 显示连接
zh_hant: 顯示連線

source: Comma-separated values. Compatible with Excel and most tools.
fr: Valeurs séparées par virgule. Compatible avec Excel et la plupart des outils.
ko: 쉼표로 구분된 값입니다. Excel 및 대부분의 도구와 호환됩니다.
tr: Virgülle ayrılmış değerler. Excel ve çoğu araçla uyumlu.
vi: Giá trị phân cách bằng dấu phẩy. Tương thích với Excel và hầu hết các công cụ.
zh_hans: 逗号分隔值。兼容 Excel 和大多数工具。
zh_hant: 逗號分隔值。相容於 Excel 與大多數工具。

source: One bastion, many connections. Editing the server or its credentials reaches every connection tunnelling through it.
fr: Un bastion, de nombreuses connexions. La modification du serveur ou de ses identifiants atteint toutes les connexions qui le tunnelent.

source: Read-Only. Choose a different connection to write changes to.
fr: En lecture seule. Choisissez une connexion différente pour écrire les modifications.
ko: 읽기 전용입니다. 변경 사항을 기록하려면 다른 연결을 선택하십시오.
tr: Salt okunur. Değişikliklerin yazılacağı farklı bir bağlantı seçin.
vi: Chỉ đọc. Hãy chọn kết nối khác để ghi thay đổi.
zh_hans: 只读。请选择其他连接来写入更改。
zh_hant: 唯讀。請選擇其他連線來寫入變更。

source: Dismiss
fr: Rejeter
ko: 닫기
tr: Kapat
vi: Bỏ qua
zh_hans: 关闭
zh_hant: 關閉

source: Are you sure you want to disconnect from this database?
fr: Êtes-vous sûr de vouloir vous déconnecter de cette base de données ?
ko: 이 데이터베이스와의 연결을 해제하시겠습니까?
tr: Bu veritabanından bağlantıyı kesmek istediğinize emin misiniz?
vi: Bạn có chắc muốn ngắt kết nối khỏi cơ sở dữ liệu này không?
zh_hans: 确定要断开与此数据库的连接吗？
zh_hant: 確定要中斷與此資料庫的連線嗎？

source: Connections are reached without asking.
fr: Les connexions sont atteintes sans demander.

source: Previous match
fr: Match précédent
ko: 이전 일치 항목
tr: Önceki eşleşme
vi: Kết quả khớp trước
zh_hans: 上一个匹配
zh_hant: 上一個符合項目

source: edited
fr: Édité

source: Undo
fr: Annuler
ko: 실행 취소
vi: Hoàn tác
zh_hans: 撤销
zh_hant: 復原

source: Kind
fr: Gentil
ko: 종류
tr: Tür
vi: Loại
zh_hans: 类型
zh_hant: 類型

source: This will detach partition '%@'. Data will be preserved but inaccessible until re-attached.
fr: Cela détachera la partition '%@'. Les données seront conservées mais inaccessibles jusqu'à ce qu'elles soient réattachées.
ko: 파티션 '%@'을(를) 분리합니다. 데이터는 보존되지만 다시 연결할 때까지 접근할 수 없습니다.
tr: '%@' bölümü ayrılacak. Veriler korunacak ancak yeniden bağlanana kadar erişilemez olacak.
vi: Thao tác này sẽ tách rời phân vùng '%@'. Dữ liệu sẽ được giữ lại nhưng không truy cập được cho đến khi gắn lại.
zh_hans: 此操作将分离分区 '%@'。数据将被保留但在重新挂载前不可访问。
zh_hant: 此操作將分離分割區「%@」。資料會保留，但在重新附加前無法存取。

source: This connection is open in Agent mode, so every write the assistant proposes waits for you.
fr: Cette connexion est ouverte en mode Agent, donc chaque écriture que l'assistant propose vous attend.

source: Skip it
fr: Oubliez-le

source: Only the first %1$lld nodes were loaded. Switch to %2$@ to see the whole value.
fr: Seuls les premiers %1$lld nœuds ont été chargés. Changez en %2$@ pour voir la valeur totale.
ko: 처음 %1$lld개의 노드만 불러왔습니다. 전체 값을 보려면 %2$@ 옵션으로 전환하십시오.
tr: Yalnızca ilk %1$lld düğüm yüklendi. Değerin tamamını görmek için %2$@ görünümüne geçin.
vi: Chỉ %1$lld nút đầu tiên được tải. Chuyển sang %2$@ để xem toàn bộ giá trị.
zh_hans: 只加载了前 %1$lld 个节点。切换到 %2$@ 以查看完整值。
zh_hant: 只載入了前 %1$lld 個節點。切換到 %2$@ 以查看完整值。

source: lowercase
fr: minuscules

source: Add Server…
fr: Ajouter le serveur...

source: The ChatGPT sign-in token could not be read.
fr: Le jeton de connexion ChatGPT n'a pas pu être lu.
ko: ChatGPT 로그인 토큰을 읽을 수 없습니다.
tr: ChatGPT giriş belirteci okunamadı.
vi: Không thể đọc mã đăng nhập ChatGPT.
zh_hans: 无法读取 ChatGPT 登录令牌。
zh_hant: 無法讀取 ChatGPT 登入權杖。

source: %@ of the largest step
fr: %@ de la plus grande étape

source: Keep Other Version
fr: Gardez une autre version
ko: 다른 버전 유지
vi: Giữ phiên bản khác
zh_hans: 保留其他版本
zh_hant: 保留其他版本

source: %d favorites will be permanently deleted.
fr: %d favoris seront supprimés définitivement.
ko: %d개 즐겨찾기가 영구적으로 삭제됩니다.
tr: %d favori kalıcı olarak silinecek.
vi: %d mục yêu thích sẽ bị xoá vĩnh viễn.
zh_hans: %d 个收藏将被永久删除。
zh_hant: %d 個我的最愛將會永久刪除。

source: Rename
fr: Rebaptiser
ko: 이름 변경
tr: Yeniden Adlandır
vi: Đổi tên
zh_hans: 重命名
zh_hant: 重新命名

source: Verified by TablePro
fr: Vérifié par TablePro
ko: TablePro에서 확인됨
vi: Đã xác minh bởi TablePro
zh_hans: 已通过 TablePro 验证
zh_hant: 已通過 TablePro 驗證

source: Choose a connection
fr: Choisissez une connexion

source: Search values
fr: Valeurs de recherche
ko: 값 검색
tr: Değerlerde ara
vi: Tìm giá trị
zh_hans: 搜索值
zh_hant: 搜尋值

source: Signed in with xAI
fr: Connecté avec xAI
ko: xAI로 로그인됨
tr: xAI ile oturum açıldı
vi: Đã đăng nhập bằng xAI
zh_hans: 已使用 xAI 登录
zh_hant: 已使用 xAI 登入

source: Your license has expired
fr: Votre permis a expiré.
ko: 라이선스가 만료되었습니다
tr: Lisansınızın süresi doldu
vi: Giấy phép của bạn đã hết hạn
zh_hans: 您的许可证已过期
zh_hant: 你的授權已過期

source: The table changed while the script was open. Nothing was run. Close and reopen the structure tab, then try again.
fr: La table a changé pendant que le script était ouvert. Rien n'a été exécuté. Fermez et rouvrez l'onglet Structure, puis réessayez.

source: Clear Saved Changes?
fr: Effacer les modifications enregistrées ?
ko: 저장된 변경 사항을 지우시겠습니까?
tr: Kaydedilen Değişiklikler Silinsin mi?
vi: Xoá các thay đổi đã lưu?
zh_hans: 要清除已保存的更改吗？
zh_hant: 要清除已儲存的變更嗎？

source: Open Workspaces
fr: Espaces de travail ouverts
ko: 워크스페이스 열기
tr: Açık Çalışma Alanları
vi: Không gian làm việc đang mở
zh_hans: 已打开的工作区
zh_hant: 已開啟的工作區

source: OAuth Refresh Token
fr: Token de rafraîchissement OAuth

source: Show ER Diagram
fr: Afficher le schéma ER
ko: ER 다이어그램 보기
tr: ER Diyagramını Göster
vi: Hiện sơ đồ ER
zh_hans: 显示 ER 图
zh_hant: 顯示 ER 圖

source: Stop and Quit
fr: Arrêter et quitter
ko: 중지하고 종료
tr: Durdur ve Çık
vi: Dừng và thoát
zh_hans: 停止并退出
zh_hant: 停止並結束

source: Updated to v%@
fr: Mis à jour vers v%@
ko: 버전 v%@ 업데이트됨
tr: v%@ sürümüne güncellendi
vi: Đã cập nhật lên v%@
zh_hans: 已更新到 v%@
zh_hant: 已更新至 v%@

source: Right-click a cell and choose Highlight to color rows by value.
fr: Cliquez avec le bouton droit de la souris sur une cellule et choisissez Souligner pour colorer les lignes par valeur.

source: Tab that came forward
fr: La barre qui est apparue en avant
ko: 앞으로 나온 탭
tr: Öne gelen sekme
vi: Tab đã được đưa lên trước
zh_hans: 被带到最前的标签页
zh_hant: 被帶到最前的標籤頁

source: Sidebar as List
fr: Barre latérale sous forme de liste
ko: 목록형 사이드바
tr: Sidebar'ı Liste Olarak Göster
vi: Thanh bên dạng danh sách
zh_hans: 侧边栏显示为列表
zh_hant: 側邊欄顯示為清單

source: Include in iCloud Sync
fr: Inclure dans la synchronisation iCloud
ko: iCloud 동기화에 포함
tr: iCloud Eşitlemesine Dahil Et
vi: Đưa vào đồng bộ iCloud
zh_hans: 包含在 iCloud 同步中
zh_hant: 納入 iCloud 同步

source: ISO 8601 (2024-12-31 23:59:59)
fr: ISO 8601 (31-12-2024 23:59:59)

source: Plans are saved with query history. Resume history to start collecting them.
fr: Les plans sont enregistrés avec l'historique des requêtes. Réinitialisez l'historique pour commencer à les collecter.
ko: 플랜은 쿼리 기록과 함께 저장됩니다. 기록을 다시 시작하면 수집이 시작됩니다.
tr: Planlar sorgu geçmişiyle birlikte kaydedilir. Toplamaya başlamak için geçmişi sürdürün.
vi: Kế hoạch được lưu cùng lịch sử truy vấn. Tiếp tục lịch sử để bắt đầu thu thập.
zh_hans: 计划随查询历史一起保存。恢复历史记录即可开始收集。
zh_hant: 計劃隨查詢歷史一起儲存。恢復歷史記錄即可開始收集。

source: Median
fr: Médiane

source: Include this table in the comparison
fr: Incluez cette table dans le comparatif
ko: 이 테이블을 비교에 포함
tr: Bu tabloyu karşılaştırmaya dahil et
vi: Bao gồm bảng này trong so sánh
zh_hans: 将此表包含在比较中
zh_hant: 將此資料表納入比較

source: Sort Descending
fr: Trier par ordre décroissant
ko: 내림차순 정렬
tr: Azalan Sırala
vi: Sắp xếp giảm dần
zh_hans: 降序排列
zh_hant: 遞減排序

source: Put the suggested SQL into the query editor
fr: Mettez la requête SQL suggérée dans l'éditeur de requêtes.
ko: 제안된 SQL을 쿼리 편집기에 삽입
tr: Önerilen SQL'i sorgu düzenleyiciye koy
vi: Đưa SQL được đề xuất vào trình soạn truy vấn
zh_hans: 将建议的 SQL 放入查询编辑器
zh_hant: 將建議的 SQL 放入查詢編輯器

source: Choose %@ Row…
fr: Choisissez la ligne %@...

source: dollar sign
fr: symbole du dollar
ko: 달러 기호
tr: dolar işareti
vi: ký hiệu đô la
zh_hans: 美元符号
zh_hant: 美元符號

source: Detach Partition
fr: Détacher la partition
ko: 파티션 분리
tr: Bölümü Ayır
vi: Tách rời phân vùng
zh_hans: 分离分区
zh_hant: 分離分割區

source: This row's key cannot be matched, so it cannot be checked before writing.
fr: La clé de cette ligne ne peut pas être comparée, donc elle ne peut pas être vérifiée avant d'être écrite.
ko: 이 행의 키를 일치시킬 수 없어 쓰기 전에 확인할 수 없습니다.
tr: Bu satırın anahtarı eşleştirilemiyor, bu yüzden yazmadan önce denetlenemiyor.
vi: Không khớp được khoá của dòng này, nên không thể kiểm tra trước khi ghi.
zh_hans: 无法匹配这一行的键，因此写入前无法核对它。
zh_hant: 無法比對這一列的鍵，因此寫入前無法核對它。

source: %@ row changed.
fr: %@ ligne modifiée.

source: Ask about your database…
fr: Demandez des informations sur votre base de données...
ko: 데이터베이스에 대해 질문…
tr: Veritabanınız hakkında sorun…
vi: Hỏi về cơ sở dữ liệu của bạn…
zh_hans: 询问您的数据库…
zh_hant: 詢問關於你的資料庫的問題…

source: Reset Sample
fr: Réinitialiser l'échantillon
ko: 샘플 재설정
tr: Örneği Sıfırla
vi: Đặt lại mẫu
zh_hans: 重置示例
zh_hant: 重設範例

source: What the session runs appears once the connection is up
fr: Ce qui s'exécute lors de la session apparaît une fois la connexion établie.

source: The target's rows are removed before the source's are written.
fr: Les lignes de la cible sont supprimées avant que celles de la source ne soient écrites.

source: Cannot save changes: connection is read-only
fr: Impossible d'enregistrer les modifications : la connexion est en lecture seule.
ko: 변경 사항을 저장할 수 없습니다. 연결이 읽기 전용입니다.
tr: Değişiklikler kaydedilemiyor: bağlantı salt okunur
vi: Không thể lưu thay đổi: kết nối ở chế độ chỉ đọc
zh_hans: 无法保存更改：连接为只读
zh_hant: 無法儲存變更：連線為唯讀

source: Last 4 Weeks
fr: Dernières 4 semaines
ko: 최근 4주
tr: Son 4 Hafta
vi: 4 tuần qua
zh_hans: 最近 4 周
zh_hant: 最近 4 週

source: Password command produced too much output
fr: La commande de mot de passe a produit trop de résultats.
ko: 암호 명령의 출력이 너무 많습니다
tr: Parola komutu çok fazla çıktı üretti
vi: Lệnh mật khẩu tạo ra quá nhiều dữ liệu đầu ra
zh_hans: 密码命令产生的输出过多
zh_hant: 密碼指令產生的輸出過多

source: Export %1$@ to %2$@
fr: Exporter %1$@ vers %2$@

source: The target has it, but its structure could not be read.
fr: La cible l'a, mais sa structure ne pouvait pas être lu.

source: Show Identical Objects
fr: Afficher des objets identiques
ko: 동일한 객체 표시
tr: Aynı Nesneleri Göster
vi: Hiện các đối tượng giống hệt
zh_hans: 显示完全相同的对象
zh_hant: 顯示完全相同的物件

source: Maximum rows to return. Defaults to the server's configured row limit.
fr: Nombre maximum de lignes à retourner. Par défaut, il est égal au limite de lignes configuré par le serveur.
ko: 반환할 최대 행 수입니다. 기본값은 서버에 설정된 행 제한입니다.
tr: Döndürülecek en fazla satır. Varsayılan olarak sunucunun yapılandırılmış satır sınırıdır.
vi: Số dòng tối đa trả về. Mặc định là giới hạn dòng được cấu hình trên máy chủ.
zh_hans: 返回的最大行数。默认为服务器配置的行数上限。
zh_hant: 回傳的最大列數。預設為伺服器設定的列數上限。

source: Remove Highlight
fr: Supprimer le soulignement

source: Baseline
fr: Base
ko: 기준
tr: Referans
vi: Cơ sở
zh_hans: 基准
zh_hant: 基準

source: Built-in
fr: Intégré
ko: 내장
tr: Yerleşik
vi: Tích hợp sẵn
zh_hans: 内置
zh_hant: 內建

source: No Tables
fr: Pas de tables
ko: 테이블 없음
vi: Không có bảng
zh_hans: 无表
zh_hant: 沒有資料表

source: Output
fr: Sortie

source: Failed to Load
fr: Impossible de charger
ko: 불러오지 못했습니다
tr: Yükleme Başarısız
vi: Tải thất bại
zh_hans: 加载失败
zh_hant: 載入失敗

source: %@ stops being a computed column
fr: %@ cesse d'être une colonne calculée

source: Global
fr: Mondial
ko: 전역
tr: Genel
vi: Toàn cục
zh_hans: 全局
zh_hant: 全域

source: Open Sample Database
fr: Base de données d'échantillons ouverte
ko: 샘플 데이터베이스 열기
tr: Örnek Veritabanını Aç
vi: Mở cơ sở dữ liệu mẫu
zh_hans: 打开示例数据库
zh_hant: 開啟範例資料庫

source: Tables that carry at least one index
fr: Des tables qui contiennent au moins un index
ko: 인덱스가 하나 이상 있는 테이블
tr: En az bir indeks taşıyan tablolar
vi: Các bảng có ít nhất một chỉ mục
zh_hans: 至少带有一个索引的表
zh_hant: 至少帶有一個索引的資料表

source: Preview %@
fr: Aperçu %@
ko: %@ 미리보기
tr: Önizleme %@
vi: Xem trước %@
zh_hans: 预览 %@
zh_hant: 預覽 %@

source: Tables that carry at least one foreign key
fr: Des tables qui contiennent au moins une clé étrangère.
ko: 외래 키가 하나 이상 있는 테이블
tr: En az bir yabancı anahtar taşıyan tablolar
vi: Các bảng có ít nhất một khoá ngoại
zh_hans: 至少带有一个外键的表
zh_hant: 至少帶有一個外鍵的資料表

source: A value could not be written as JSON.
fr: Une valeur ne pouvait pas être écrite sous forme JSON.

source: Category: %@
fr: Catégorie : %@
ko: 카테고리: %@
tr: Kategori: %@
vi: Danh mục: %@
zh_hans: 类别：%@
zh_hant: 類別：%@

source: The license key is invalid.
fr: La clé de licence est invalide.
ko: 라이선스 키가 유효하지 않습니다.
tr: Lisans anahtarı geçersiz.
vi: Mã giấy phép không hợp lệ.
zh_hans: 许可证密钥无效。
zh_hant: 授權金鑰無效。

source: Add the JSON below inside the file and save
fr: Ajoutez le JSON ci-dessous à l'intérieur du fichier et enregistrez-le.
ko: 아래 JSON을 파일에 추가하고 저장하십시오
tr: Aşağıdaki JSON'u dosyaya ekleyin ve kaydedin
vi: Thêm JSON dưới đây vào tệp và lưu lại
zh_hans: 将下方 JSON 添加到文件中并保存
zh_hant: 將下方 JSON 加入檔案中並儲存

source: Current %1$@: %2$@ (read only)
fr: %1$@ actuel : %2$@ (lecture uniquement)
ko: 현재 %1$@: %2$@ (읽기 전용)
tr: Geçerli %1$@: %2$@ (salt okunur)
vi: %1$@ hiện tại: %2$@ (chỉ đọc)
zh_hans: 当前 %1$@：%2$@（只读）
zh_hant: 目前 %1$@：%2$@（唯讀）

source: Tool
fr: Outil
ko: 도구
tr: Araç
vi: Công cụ
zh_hans: 工具
zh_hant: 工具

source: There is nothing to format yet.
fr: Il n'y a rien à formater encore.

source: Streaming failed: %@
fr: Échec du streaming : %@
ko: 스트리밍 실패: %@
tr: Akış başarısız: %@
vi: Phát trực tuyến thất bại: %@
zh_hans: 流式传输失败：%@
zh_hant: 串流失敗：%@

source: This license has reached its activation limit. Deactivate another Mac first.
fr: Cette licence a atteint sa limite d'activation. D'abord désactivez un autre Mac.
ko: 이 라이선스는 활성화 한도에 도달했습니다. 먼저 다른 Mac에서 비활성화하십시오.
tr: Bu lisans etkinleştirme sınırına ulaştı. Önce başka bir Mac'i devre dışı bırakın.
vi: Giấy phép này đã đạt giới hạn kích hoạt. Hãy huỷ kích hoạt một máy Mac khác trước.
zh_hans: 此许可证已达到激活上限。请先停用另一台 Mac。
zh_hant: 此授權已達啟用上限。請先停用另一台 Mac。

source: Source Unavailable
fr: Source indisponible
ko: 소스를 사용할 수 없음
tr: Kaynak Kullanılamıyor
vi: Không có nguồn
zh_hans: 源不可用
zh_hant: 來源無法使用

source: Open File
fr: Ouvrir le fichier
ko: 파일 열기
tr: Dosya Aç
vi: Mở tệp
zh_hans: 打开文件
zh_hant: 開啟檔案

source: Quit TablePro
fr: Quitter TablePro
ko: TablePro 종료
tr: TablePro'dan Çık
vi: Thoát TablePro
zh_hans: 退出 TablePro
zh_hant: 結束 TablePro

source: None Available
fr: Aucun disponible

source: %d selected
fr: %d sélectionnés
ko: %d개 선택됨
tr: %d seçili
vi: Đã chọn %d
zh_hans: 已选择%d个
zh_hant: 已選取 %d 個

source: Export completed successfully
fr: Exportation terminée avec succès
ko: 내보내기를 완료했습니다
tr: Dışa aktarma başarıyla tamamlandı
vi: Xuất dữ liệu thành công
zh_hans: 导出成功
zh_hant: 匯出成功完成

source: SQL import is not supported for %@ connections.
fr: L'importation SQL n'est pas prise en charge pour les connexions %@.
ko: %@ 연결에서는 SQL 가져오기를 지원하지 않습니다.
tr: %@ bağlantıları için SQL içe aktarma desteklenmiyor.
vi: Nhập SQL không được hỗ trợ cho kết nối %@.
zh_hans: 不支持对 %@ 连接进行 SQL 导入。
zh_hant: %@ 連線不支援 SQL 匯入。

source: Edit...
fr: Modifier...
ko: 편집...
tr: Düzenle...
vi: Chỉnh sửa...
zh_hans: 编辑…
zh_hant: 編輯…

source: Recent Tabs
fr: Fenêtres de navigation récentes
ko: 최근 탭
tr: Son Sekmeler
vi: Tab gần đây
zh_hans: 最近的标签页
zh_hant: 最近的分頁

source: Finish Signing In
fr: Terminez la connexion
ko: 로그인 마치기
tr: Oturum Açmayı Tamamla
vi: Hoàn tất đăng nhập
zh_hans: 完成登录
zh_hant: 完成登入

source: Database File
fr: Fichier de base de données
ko: 데이터베이스 파일
tr: Veritabanı Dosyası
vi: Tệp cơ sở dữ liệu
zh_hans: 数据库文件
zh_hant: 資料庫檔案

source: “%1$@” exited with status %2$d on the server: %3$@
fr: «%1$@» s’est terminé avec le statut %2$d sur le serveur : %3$@
ko: 서버에서 “%1$@”이(가) 상태 %2$d(으)로 종료되었습니다: %3$@
tr: “%1$@” sunucuda %2$d durumuyla sonlandı: %3$@
vi: “%1$@” kết thúc với mã trạng thái %2$d trên máy chủ: %3$@
zh_hans: “%1$@” 在服务器上以状态 %2$d 退出：%3$@
zh_hant: “%1$@” 在伺服器上以狀態 %2$d 結束：%3$@

source: backtick
fr: Point d'interrogation arrière
ko: 백틱
tr: ters tırnak
vi: dấu nháy ngược
zh_hans: 反引号
zh_hant: 反引號

source: Host:
fr: Animateur :
ko: 호스트:
tr: Sunucu:
vi: Máy chủ:
zh_hans: 主机：
zh_hant: 主機：

source: The SQL after DEFAULT. A text value needs its own quotes.
fr: La SQL après DEFAULT. Une valeur de texte a besoin de ses propres guillemets.

source: Optional. Set this to reach a database that only listens on a Unix socket.
fr: Facultatif. Définissez-le pour accéder à une base de données qui ne répond qu'à un socket Unix.
ko: 선택 사항입니다. Unix 소켓에서만 수신 대기하는 데이터베이스에 연결하려면 설정하십시오.
tr: İsteğe bağlı. Yalnızca Unix soketi dinleyen bir veritabanına erişmek için ayarlayın.
vi: Tùy chọn. Đặt giá trị này để truy cập cơ sở dữ liệu chỉ lắng nghe trên Unix socket.
zh_hans: 可选。当数据库只监听 Unix socket 时设置此项。
zh_hant: 選填。當資料庫只監聽 Unix socket 時設定此項。

source: Connect a Client
fr: Connectez un client
ko: 클라이언트 연결
tr: Bir İstemci Bağla
vi: Kết nối client
zh_hans: 连接客户端
zh_hant: 連線用戶端

source: No Spatial Column
fr: Pas de colonne spatiale

source: Group Not Updated
fr: Groupe non mis à jour
ko: 그룹이 업데이트되지 않음
tr: Grup Güncellenmedi
vi: Nhóm chưa được cập nhật
zh_hans: 分组未更新
zh_hant: 群組未更新

source: Plugin installation failed: %@
fr: Installation du plugin échouée : %@
ko: 플러그인 설치 실패: %@
tr: Eklenti kurulumu başarısız: %@
vi: Cài đặt plugin thất bại: %@
zh_hans: 插件安装失败：%@
zh_hant: 外掛安裝失敗：%@

source: Statistics
fr: Statistiques

source: False for a constraint the engine has not checked against existing rows
fr: Faux pour une contrainte que le moteur n'a pas vérifiée contre les lignes existantes.

source: Materialized View: %@
fr: Vue matérialisée : %@

source: Scatter
fr: Disperser
ko: 분산형
tr: Dağılım
vi: Phân tán
zh_hans: 散点
zh_hant: 散佈

source: 1 statement would destroy data. Allow it or exclude it before applying.
fr: 1 déclaration détruirait les données. Autorisez-la ou excluez-la avant de postuler.

source: Copilot language server binary not found
fr: Serveur de langage Copilot binaire non trouvé
ko: Copilot 언어 서버 바이너리를 찾을 수 없습니다
tr: Copilot dil sunucusu ikili dosyası bulunamadı
vi: Không tìm thấy binary của Copilot language server
zh_hans: 未找到 Copilot 语言服务器可执行文件
zh_hant: 找不到 Copilot 語言伺服器執行檔

source: Text Encoding
fr: Encodage de texte

source: Sidebar
fr: Barre latérale
ko: 사이드바
vi: Thanh bên
zh_hans: 侧边栏
zh_hant: 側邊欄
